jmeter/seckill_order_test_v2.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Seckill Async Order v2 NoPlugin" enabled="true">
      <stringProp name="TestPlan.comments">Activity diagnosis: create at 300 rps, enhanced orderNo extraction, query status split (2xx/4xx/other).</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="HOST" elementType="Argument">
            <stringProp name="Argument.name">HOST</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ACTIVITY_ID" elementType="Argument">
            <stringProp name="Argument.name">ACTIVITY_ID</stringProp>
            <stringProp name="Argument.value">2040778459919290368</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PRICE_GOODS_3" elementType="Argument">
            <stringProp name="Argument.name">PRICE_GOODS_3</stringProp>
            <stringProp name="Argument.value">80.00</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PRICE_GOODS_4" elementType="Argument">
            <stringProp name="Argument.name">PRICE_GOODS_4</stringProp>
            <stringProp name="Argument.value">80.00</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="QUERY_WAIT_MIN_MS" elementType="Argument">
            <stringProp name="Argument.name">QUERY_WAIT_MIN_MS</stringProp>
            <stringProp name="Argument.value">1000</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="QUERY_WAIT_RANGE_MS" elementType="Argument">
            <stringProp name="Argument.name">QUERY_WAIT_RANGE_MS</stringProp>
            <stringProp name="Argument.value">500</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TG-CreateAndQuery" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">800</stringProp>
        <stringProp name="ThreadGroup.ramp_time">60</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">180</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>

        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Users" enabled="true">
          <stringProp name="filename">users.csv</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="variableNames">userId</stringProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">false</boolProp>
          <boolProp name="stopThread">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
        </CSVDataSet>
        <hashTree/>

        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Defaults" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        </ConfigTestElement>
        <hashTree/>

        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiIzIiwiaWF0IjoxNzc1MzkxNDIxLCJleHAiOjE3NzU0Nzc4MjF9.Wkn1y6vLTwwaGEd8a2YhlO1eWn9Vo3cE7AobonL5WmQ</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="Global Counter" enabled="true">
          <stringProp name="CounterConfig.start">1</stringProp>
          <stringProp name="CounterConfig.end">999999999</stringProp>
          <stringProp name="CounterConfig.incr">1</stringProp>
          <stringProp name="CounterConfig.name">seq</stringProp>
          <boolProp name="CounterConfig.per_user">false</boolProp>
          <boolProp name="CounterConfig.reset_on_tg_iteration">false</boolProp>
        </CounterConfig>
        <hashTree/>

        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Split goods 3/4 by seq" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script"><![CDATA[
int s = Integer.parseInt(vars.get("seq"))
if (s % 2 == 0) {
  vars.put("goodsId", "3")
  vars.put("seckillPrice", vars.get("PRICE_GOODS_3"))
} else {
  vars.put("goodsId", "4")
  vars.put("seckillPrice", vars.get("PRICE_GOODS_4"))
}
          ]]></stringProp>
        </JSR223PreProcessor>
        <hashTree/>

        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="CTT Target 300 rps on create" enabled="true">
          <stringProp name="calcMode">1</stringProp>
          <doubleProp>
            <name>throughput</name>
            <value>18000.0</value>
            <savedValue>0.0</savedValue>
          </doubleProp>
        </ConstantThroughputTimer>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create Order" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value"><![CDATA[
{
  "activityId": ${ACTIVITY_ID},
  "goodsId": ${goodsId},
  "userId": ${userId},
  "quantity": 1,
  "seckillPrice": ${seckillPrice},
  "status": 0
}
                ]]></stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/seckill/order</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract orderNo" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">orderNoA;orderNoB;orderNoC</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.seckillOrderNo;$.orderNo;$.data.seckillOrderNo</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1;1;1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">NOT_FOUND;NOT_FOUND;NOT_FOUND</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Normalize orderNo" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script"><![CDATA[
String a = vars.get("orderNoA")
String b = vars.get("orderNoB")
String c = vars.get("orderNoC")
String normalized = "NOT_FOUND"
for (String candidate : [a, b, c]) {
  if (candidate != null && candidate != "NOT_FOUND" && candidate.trim().length() > 0) {
    normalized = candidate.trim()
    break
  }
}
vars.put("orderNo", normalized)
          ]]></stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>

        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Only query if create 2xx and has orderNo" enabled="true">
          <stringProp name="IfController.condition">${__groovy(def code = prev.getResponseCode(); code != null &amp;&amp; code.isInteger() &amp;&amp; (code as int) &gt;= 200 &amp;&amp; (code as int) &lt; 300 &amp;&amp; vars.get('orderNo') != 'NOT_FOUND')}</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
        </IfController>
        <hashTree>

          <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Query max 3 times" enabled="true">
            <boolProp name="LoopController.continue_forever">false</boolProp>
            <stringProp name="LoopController.loops">2</stringProp>
          </LoopController>
          <hashTree>

            <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Wait 2~3s" enabled="true">
              <stringProp name="ConstantTimer.delay">${QUERY_WAIT_MIN_MS}</stringProp>
              <stringProp name="RandomTimer.range">${QUERY_WAIT_RANGE_MS}</stringProp>
            </UniformRandomTimer>
            <hashTree/>

            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Query Order By No" enabled="true">
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                <collectionProp name="Arguments.arguments"/>
              </elementProp>
              <stringProp name="HTTPSampler.path">/api/seckill/order/no/${orderNo}</stringProp>
              <stringProp name="HTTPSampler.method">GET</stringProp>
              <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
              <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            </HTTPSamplerProxy>
            <hashTree>
              <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Tag query sample by HTTP code" enabled="true">
                <stringProp name="scriptLanguage">groovy</stringProp>
                <stringProp name="script"><![CDATA[
String code = prev.getResponseCode()
if (code != null && code.isInteger()) {
  int c = code as int
  if (c >= 200 && c < 300) {
    prev.setSampleLabel("Query Order By No [2xx]")
  } else if (c >= 400 && c < 500) {
    prev.setSampleLabel("Query Order By No [4xx]")
  } else {
    prev.setSampleLabel("Query Order By No [other]")
  }
} else {
  prev.setSampleLabel("Query Order By No [non-http]")
}
              ]]></stringProp>
              </JSR223PostProcessor>
              <hashTree/>
            </hashTree>

            <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Stop query loop if 200 or 4xx" enabled="true">
              <stringProp name="IfController.condition">${__groovy(def code = prev.getResponseCode(); code != null &amp;&amp; code.isInteger() &amp;&amp; ((code as int) == 200 || ((code as int) &gt;= 400 &amp;&amp; (code as int) &lt; 500)))}</stringProp>
              <boolProp name="IfController.evaluateAll">false</boolProp>
            </IfController>
            <hashTree>
              <TestAction guiclass="TestActionGui" testclass="TestAction" testname="Break Loop" enabled="true">
                <intProp name="ActionProcessor.action">1</intProp>
                <intProp name="ActionProcessor.target">0</intProp>
                <stringProp name="ActionProcessor.duration">0</stringProp>
              </TestAction>
              <hashTree/>
            </hashTree>

          </hashTree>
        </hashTree>

      </hashTree>

      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">results_300tps_activity_diag.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>